In [13]:
import numpy as np
import pandas as pd

In [14]:
data_one = {'A': ['A0','A1','A2','A3'], 'B': ['B0','B1','B2','B3']}
data_two = {'C': ['C0','C1','C2','C3'], 'D': ['D0','D1','D2','D3']}
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [15]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [16]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [17]:
pd.concat([one,two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [18]:
pd.concat([one,two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [19]:
two.columns = one.columns
mydf = pd.concat([one,two],axis=0)
mydf.index = range(len(mydf)) # izgenerira index da bude unique
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [31]:
# inner merge
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [32]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [33]:
pd.merge(registrations,logins, how='inner', on='name') # nije bitno da li registration ili logins prvo navedec, kod ostalih je bitno

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [34]:
pd.merge(left=registrations,right=logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [39]:
pd.merge(left=registrations,right=logins, how='right', on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4